FOAM/OpenFOAM_case/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Momentum source that maintains the target cross-sectional mean velocity
// Ubar (see Ubar.H) throughout the domain -- equivalent to the pressure
// gradient driving the fully developed channel flow. The free surface is
// modelled as a free-slip rigid lid (top = symmetryPlane in 0/U).

momentumSource
{
    type            meanVelocityForce;

    selectionMode   all;

    fields          (U);
#include "Ubar.H"
}


// ************************************************************************* //
